In [1]:
import pandas as pd

In [2]:
a = {'a' : [1, 2, 3], 'b' : [1, 3, 5], 'c' : [2, 4, 6], 'd' : [3, 6, 9]}

In [3]:
a

{'a': [1, 2, 3], 'b': [1, 3, 5], 'c': [2, 4, 6], 'd': [3, 6, 9]}

In [4]:
df1 = pd.DataFrame(a)

In [5]:
df1

   a  b  c  d
0  1  1  2  3
1  2  3  4  6
2  3  5  6  9

In [6]:
type(df1)

pandas.core.frame.DataFrame

In [7]:
df1.shape

(3, 4)

In [8]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
dtypes: int64(4)
memory usage: 224.0 bytes

In [9]:
import numpy as np

In [10]:
b = np.arange(12).reshape(3, 4)

In [11]:
b

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [13]:
df2 = pd.DataFrame(b)

In [14]:
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [15]:
type(df2)

pandas.core.frame.DataFrame

In [16]:
df2.shape

(3, 4)

In [17]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int32
 1   1       3 non-null      int32
 2   2       3 non-null      int32
 3   3       3 non-null      int32
dtypes: int32(4)
memory usage: 176.0 bytes

In [19]:
df = pd.DataFrame([[1, 2, '서울'], [2, 25, '대전']],
                 index = ['홍길동', '홍길순'],
                 columns = ['순서', '나이', '지역'])

In [20]:
df

     순서  나이  지역
홍길동   1   2  서울
홍길순   2  25  대전

In [21]:
type(df)

pandas.core.frame.DataFrame

In [22]:
df.shape

(2, 3)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, 홍길동 to 홍길순
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   순서      2 non-null      int64
 1   나이      2 non-null      int64
 2   지역      2 non-null      object
dtypes: int64(2), object(1)
memory usage: 64.0+ bytes

In [24]:
df.index

Index(['홍길동', '홍길순'], dtype='object')

In [25]:
df.columns

Index(['순서', '나이', '지역'], dtype='object')

In [26]:
df.values

array([[1, 2, '서울'],
       [2, 25, '대전']], dtype=object)

In [27]:
df.index = ['사람1', '사람2']

In [28]:
df

     순서  나이  지역
사람1   1   2  서울
사람2   2  25  대전

In [29]:
df.columns = ['연번', '연령', '도시']

In [30]:
df

     연번  연령  도시
사람1   1   2  서울
사람2   2  25  대전

In [31]:
df = df.rename(index = {'사람1' : '홍길동'})

In [32]:
df

     연번  연령  도시
홍길동   1   2  서울
사람2   2  25  대전

In [33]:
df = df.rename(columns = { '연번':'순서', '연령':'나이'})

In [34]:
df

     순서  나이  도시
홍길동   1   2  서울
사람2   2  25  대전